{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence listing deployment and build-identifier related files with feature metadata.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend source files to their descriptions for reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/scripts/build-frontend.sh": "Build script generating a timestamped build ID, installing deps, generating bindings, and building the frontend.",
  "frontend/scripts/deploy.sh": "Deployment script building the frontend, deploying canisters, and printing the resulting URL.",
  "frontend/scripts/print-frontend-url.sh": "Script that prints the frontend canister URL for either local or mainnet.",
  "frontend/src/App.tsx": "Root React component managing section navigation and rendering the active section within MobileShell.",
  "frontend/src/buildInfo.ts": "Utility providing build ID and formatted display text from Vite environment variables.",
  "frontend/src/components/layout/MobileShell.tsx": "Layout wrapper adding background styling and a footer showing the build identifier.",
  "frontend/src/components/navigation/BottomNav.tsx": "Fixed bottom navigation bar for switching between About, Past Years, and Future Plans sections.",
  "frontend/src/content/profileContent.ts": "Static profile data module defining about, past years, and future plans content with TypeScript types.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor instance tied to Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive Internet Identity authentication hook and provider handling login, identity loading, and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future backend-related React Query hooks.",
  "frontend/src/index.css": "Defines Tailwind layers and sets light/dark OKLCH color variables, global styles, and smooth scrolling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/sections/AboutSection.tsx": "Renders the About Me section with avatar, bio, highlights, and a footer attribution link.",
  "frontend/src/sections/FuturePlansSection.tsx": "Displays a list of future plans using cards and badges, with a fallback when no plans exist.",
  "frontend/src/sections/PastYearsSection.tsx": "Shows past experience entries in a card list with year labels and includes an empty-state fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugins.",
  "project_state.json": "Stores project metadata, existing features, issues, and planned backend work for content persistence."
}